Documents/ВзятиеФигуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ВзятиеФигуры</Name>
			<BasedOn>
				<xr:Item>Document.ПеремещениеФигуры</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостояниеПартии</xr:Item>
				<xr:Item>InformationRegister.СостояниеФигур</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФигураИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фигуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФигураНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фигуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеФигуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СостояниеФигур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СостояниеФигур</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Взята</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗамененаНаТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыФигур</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗамененаНаСимвол</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фигура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фигуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостояниеПартии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СостояниеПартии</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фигура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фигуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клетки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыФигур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыФигур</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пешка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ладья</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ферзь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Король</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВзятиеФигуры/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Если ФигураНазначение.Тип = Перечисления.ТипыФигур.Король Тогда
		Сообщить("Взятие короля запрещено.");
		Отказ = Истина;
	КонецЕсли;
		
	Движения.СостояниеФигур.Записывать = Истина;
	Движение = Движения.СостояниеФигур.Добавить();
	Движение.Период = Дата;
	Движение.Партия = Партия;
	Движение.Фигура = ФигураНазначение;
	Движение.Взята = Истина;
	
	Движения.СостояниеПартии.Записывать = Истина;
	Движение = Движения.СостояниеПартии.Добавить();
	Движение.Период = Дата;
	Движение.Партия = Партия;
	Движение.Клетка = ДокументОснование.КлеткаНазначение;
	Движение.Фигура = Неопределено;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеФигуры") Тогда		
		ФигураНазначение	= Механика.НайтиФигуруПоКлетке(ДанныеЗаполнения.Дата, 
															ДанныеЗаполнения.КлеткаНазначение, 
															ДанныеЗаполнения.Партия);
		Игрок 				= ДанныеЗаполнения.Игрок;
		Партия 				= ДанныеЗаполнения.Партия;
		ФигураИсточник 		= ДанныеЗаполнения.Фигура;
		Дата 				= ТекущаяДата();
		ДокументОснование	= ДанныеЗаполнения;
	КонецЕсли;
КонецПроцедуры
